testTesults/stage_4/1_get_empty_wrk.txt
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 4.366ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 4.118ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 4.138ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 4.327ms, rate sampling interval: 23ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.00ms   57.93ms   1.00s    99.05%
    Req/Sec     2.60k   808.74     8.48k    75.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.20ms
 75.000%    5.13ms
 90.000%   10.65ms
 99.000%   43.62ms
 99.900%  906.24ms
 99.990%  993.28ms
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.057     0.000000            1         1.00
       0.575     0.100000        50094         1.11
       0.948     0.200000       100022         1.25
       1.243     0.300000       150029         1.43
       1.653     0.400000       200052         1.67
       2.197     0.500000       250041         2.00
       2.603     0.550000       274968         2.22
       3.065     0.600000       299984         2.50
       3.603     0.650000       325025         2.86
       4.279     0.700000       350027         3.33
       5.131     0.750000       374959         4.00
       5.643     0.775000       387470         4.44
       6.239     0.800000       400018         5.00
       6.939     0.825000       412463         5.71
       7.831     0.850000       424982         6.67
       9.055     0.875000       437501         8.00
       9.799     0.887500       443730         8.89
      10.647     0.900000       449977        10.00
      11.623     0.912500       456229        11.43
      12.695     0.925000       462434        13.33
      13.903     0.937500       468690        16.00
      14.567     0.943750       471806        17.78
      15.295     0.950000       474947        20.00
      16.087     0.956250       478060        22.86
      16.975     0.962500       481191        26.67
      18.047     0.968750       484334        32.00
      18.703     0.971875       485876        35.56
      19.487     0.975000       487450        40.00
      20.367     0.978125       489001        45.71
      21.503     0.981250       490572        53.33
      23.343     0.984375       492116        64.00
      25.055     0.985938       492896        71.11
      28.351     0.987500       493674        80.00
      33.855     0.989062       494457        91.43
      78.975     0.990625       495238       106.67
     224.255     0.992188       496018       128.00
     311.295     0.992969       496408       142.22
     382.463     0.993750       496799       160.00
     460.287     0.994531       497190       182.86
     549.375     0.995313       497581       213.33
     615.423     0.996094       497973       256.00
     656.895     0.996484       498167       284.44
     696.831     0.996875       498361       320.00
     729.087     0.997266       498557       365.71
     773.631     0.997656       498752       426.67
     808.447     0.998047       498947       512.00
     829.439     0.998242       499045       568.89
     849.407     0.998437       499143       640.00
     867.327     0.998633       499242       731.43
     893.439     0.998828       499340       853.33
     910.335     0.999023       499436      1024.00
     919.551     0.999121       499484      1137.78
     924.671     0.999219       499535      1280.00
     937.983     0.999316       499585      1462.86
     947.711     0.999414       499631      1706.67
     953.343     0.999512       499679      2048.00
     959.487     0.999561       499705      2275.56
     963.071     0.999609       499728      2560.00
     968.191     0.999658       499754      2925.71
     974.335     0.999707       499777      3413.33
     979.967     0.999756       499802      4096.00
     981.503     0.999780       499816      4551.11
     983.551     0.999805       499826      5120.00
     987.135     0.999829       499838      5851.43
     990.719     0.999854       499852      6826.67
     991.743     0.999878       499862      8192.00
     992.767     0.999890       499871      9102.22
     993.279     0.999902       499875     10240.00
     994.303     0.999915       499883     11702.86
     994.815     0.999927       499887     13653.33
     996.351     0.999939       499893     16384.00
     996.863     0.999945       499897     18204.44
     997.375     0.999951       499899     20480.00
     998.399     0.999957       499904     23405.71
     998.911     0.999963       499907     27306.67
     999.423     0.999969       499909     32768.00
     999.935     0.999973       499911     36408.89
     999.935     0.999976       499911     40960.00
    1000.447     0.999979       499915     46811.43
    1000.447     0.999982       499915     54613.33
    1000.959     0.999985       499917     65536.00
    1000.959     0.999986       499917     72817.78
    1000.959     0.999988       499917     81920.00
    1001.471     0.999989       499919     93622.86
    1001.471     0.999991       499919    109226.67
    1001.983     0.999992       499922    131072.00
    1001.983     0.999993       499922    145635.56
    1001.983     0.999994       499922    163840.00
    1001.983     0.999995       499922    187245.71
    1001.983     0.999995       499922    218453.33
    1001.983     0.999996       499922    262144.00
    1001.983     0.999997       499922    291271.11
    1001.983     0.999997       499922    327680.00
    1001.983     0.999997       499922    374491.43
    1001.983     0.999998       499922    436906.67
    1002.495     0.999998       499923    524288.00
    1002.495     1.000000       499923          inf
#[Mean    =        9.002, StdDeviation   =       57.932]
#[Max     =     1001.984, Total count    =       499923]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599955 requests in 1.00m, 39.48MB read
  Non-2xx or 3xx responses: 599955
Requests/sec:   9998.80
Transfer/sec:    673.75KB
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 4672.312ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 4672.270ms, rate sampling interval: 17973ms
  Thread calibration: mean lat.: 4610.697ms, rate sampling interval: 17793ms
  Thread calibration: mean lat.: 4705.912ms, rate sampling interval: 18006ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.64s    15.67s    1.00m    65.32%
    Req/Sec     5.62      2.39     8.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   25.99s 
 75.000%   43.75s 
 90.000%    0.89m 
 99.000%    0.99m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10084.351     0.000000            1         1.00
   13590.527     0.100000          112         1.11
   14630.911     0.200000          225         1.25
   14860.287     0.300000          334         1.43
   17956.863     0.400000          446         1.67
   25985.023     0.500000          557         2.00
   29999.103     0.550000          613         2.22
   33554.431     0.600000          669         2.50
   37158.911     0.650000          724         2.86
   40665.087     0.700000          781         3.33
   43745.279     0.750000          835         4.00
   45285.375     0.775000          863         4.44
   47087.615     0.800000          891         5.00
   48660.479     0.825000          919         5.71
   50233.343     0.850000          947         6.67
   51773.439     0.875000          974         8.00
   52428.799     0.887500          988         8.89
   53215.231     0.900000         1002        10.00
   54165.503     0.912500         1018        11.43
   54984.703     0.925000         1030        13.33
   55934.975     0.937500         1046        16.00
   56393.727     0.943750         1052        17.78
   56819.711     0.950000         1058        20.00
   57147.391     0.956250         1065        22.86
   57737.215     0.962500         1073        26.67
   57966.591     0.968750         1079        32.00
   58163.199     0.971875         1082        35.56
   58425.343     0.975000         1086        40.00
   58621.951     0.978125         1090        45.71
   58785.791     0.981250         1093        53.33
   58982.399     0.984375         1098        64.00
   58982.399     0.985938         1098        71.11
   59146.239     0.987500         1101        80.00
   59146.239     0.989062         1101        91.43
   59244.543     0.990625         1103       106.67
   59375.615     0.992188         1105       128.00
   59441.151     0.992969         1106       142.22
   59506.687     0.993750         1107       160.00
   59506.687     0.994531         1107       182.86
   59572.223     0.995313         1108       213.33
   59637.759     0.996094         1109       256.00
   59670.527     0.996484         1110       284.44
   59670.527     0.996875         1110       320.00
   59670.527     0.997266         1110       365.71
   59736.063     0.997656         1111       426.67
   59736.063     0.998047         1111       512.00
   59801.599     0.998242         1112       568.89
   59801.599     0.998437         1112       640.00
   59801.599     0.998633         1112       731.43
   59801.599     0.998828         1112       853.33
   59801.599     0.999023         1112      1024.00
   59867.135     0.999121         1113      1137.78
   59867.135     1.000000         1113          inf
#[Mean    =    29642.123, StdDeviation   =    15666.590]
#[Max     =    59834.368, Total count    =         1113]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1318 requests in 1.00m, 88.81KB read
  Non-2xx or 3xx responses: 1318
Requests/sec:     21.96
Transfer/sec:      1.48KB
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 4382.298ms, rate sampling interval: 18120ms
  Thread calibration: mean lat.: 4155.040ms, rate sampling interval: 17907ms
  Thread calibration: mean lat.: 4297.592ms, rate sampling interval: 17514ms
  Thread calibration: mean lat.: 4278.753ms, rate sampling interval: 17760ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.22s    15.11s    1.00m    75.65%
    Req/Sec     4.50      2.50     7.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.67s 
 75.000%   39.09s 
 90.000%    0.85m 
 99.000%    0.97m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10100.735     0.000000            1         1.00
   13787.135     0.100000           89         1.11
   14303.231     0.200000          178         1.25
   14696.447     0.300000          268         1.43
   15007.743     0.400000          355         1.67
   15671.295     0.500000          443         2.00
   19546.111     0.550000          487         2.22
   24936.447     0.600000          530         2.50
   30326.783     0.650000          574         2.86
   34635.775     0.700000          619         3.33
   39223.295     0.750000          663         4.00
   41254.911     0.775000          685         4.44
   43286.527     0.800000          707         5.00
   45514.751     0.825000          729         5.71
   47349.759     0.850000          751         6.67
   49446.911     0.875000          774         8.00
   50364.415     0.887500          784         8.89
   51216.383     0.900000          795        10.00
   52232.191     0.912500          806        11.43
   53215.231     0.925000          818        13.33
   54034.431     0.937500          828        16.00
   54624.255     0.943750          834        17.78
   55279.615     0.950000          839        20.00
   55771.135     0.956250          845        22.86
   56295.423     0.962500          850        26.67
   56983.551     0.968750          856        32.00
   57245.695     0.971875          859        35.56
   57343.999     0.975000          861        40.00
   57573.375     0.978125          864        45.71
   57835.519     0.981250          867        53.33
   57999.359     0.984375          870        64.00
   58163.199     0.985938          871        71.11
   58261.503     0.987500          872        80.00
   58359.807     0.989062          874        91.43
   58589.183     0.990625          875       106.67
   58753.023     0.992188          877       128.00
   58753.023     0.992969          877       142.22
   58785.791     0.993750          878       160.00
   59047.935     0.994531          879       182.86
   59047.935     0.995313          879       213.33
   59310.079     0.996094          880       256.00
   59310.079     0.996484          880       284.44
   59572.223     0.996875          881       320.00
   59572.223     0.997266          881       365.71
   59572.223     0.997656          881       426.67
   59703.295     0.998047          882       512.00
   59703.295     0.998242          882       568.89
   59703.295     0.998437          882       640.00
   59703.295     0.998633          882       731.43
   59703.295     0.998828          882       853.33
   59834.367     0.999023          883      1024.00
   59834.367     1.000000          883          inf
#[Mean    =    26223.158, StdDeviation   =    15105.393]
#[Max     =    59801.600, Total count    =          883]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1023 requests in 1.00m, 68.93KB read
  Non-2xx or 3xx responses: 1023
Requests/sec:     17.04
Transfer/sec:      1.15KB